InformationRegisters/КассовыеДаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>КассовыеДаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстрономическаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КассоваяДата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовыеДаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КассовыеДаты/Ext/ManagerModule.bsl
Функция ПолучитьДату(КассоваяДата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.КассовыеДаты.Получить(Новый Структура("КассоваяДата", КассоваяДата.Ссылка));
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(Запись.Дата);
	
КонецФункции // ПолучитьДату()

Процедура УстановитьДату(КассоваяДата, Дата, Отказ) Экспорт
	
	Если Не Отказ Тогда
	
		УстановитьПривилегированныйРежим(Истина);

		Запись = РегистрыСведений.КассовыеДаты.СоздатьМенеджерЗаписи();
		Запись.КассоваяДата = КассоваяДата.Ссылка;
		Запись.Дата = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(Дата);
			
		Попытка
			Запись.Записать(Истина);
		Исключение
			Отказ = Истина; // ERR.
			//ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ОписаниеОшибки(), Отказ, ,, НаборЗаписей, Ссылка);
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
	
	КонецЕсли;
	
КонецПроцедуры // УстановитьДату()


Функция ПолучитьПараметрыКассовойДаты(КассоваяДата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.КассовыеДаты.Получить(Новый Структура("КассоваяДата", КассоваяДата.Ссылка));
	Запись.Дата = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(Запись.Дата);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Запись;
	
КонецФункции // ПолучитьПараметрыКассовойДаты()
